// Задание 2
// Вы управляете рестораном, в котором работают разные повара, специализирующиеся на определенных блюдах. Клиенты приходят и делают заказы на разные блюда.

// Необходимо создать систему управления этими заказами, которая позволит:

// • Отслеживать, какой повар готовит какое блюдо.
// • Записывать, какие блюда заказал каждый клиент.

// Используйте коллекции Map для хранения блюд и их поваров, а также для хранения заказов каждого клиента. В качестве ключей для клиентов используйте объекты.

// Повара и их специализации:

// Виктор - специализация: Пицца.
// Ольга - специализация: Суши.
// Дмитрий - специализация: Десерты.

// Блюда и их повара:

// Пицца "Маргарита" - повар: Виктор.
// Пицца "Пепперони" - повар: Виктор.
// Суши "Филадельфия" - повар: Ольга.
// Суши "Калифорния" - повар: Ольга.
// Тирамису - повар: Дмитрий.
// Чизкейк - повар: Дмитрий.

// Заказы:

// Клиент Алексей заказал: Пиццу "Пепперони" и Тирамису.
// Клиент Мария заказала: Суши "Калифорния" и Пиццу "Маргарита".
// Клиент Ирина заказала: Чизкейк.

// Создание коллекции Map для поваров и их специализации
const chefsSpecialization = new Map([
  ["Виктор", "Пицца"],
  ["Ольга", "Суши"],
  ["Дмитрий", "Десерты"],
]);

// Создание коллекции Map для блюд и их повара
const dishesAndChefs = new Map([
  ['Пицца "Маргарита"', "Виктор"],
  ['Пицца "Пепперони"', "Виктор"],
  ['Суши "Филадельфия"', "Ольга"],
  ['Суши "Калифорния"', "Ольга"],
  ["Тирамису", "Дмитрий"],
  ["Чизкейк", "Дмитрий"],
]);

// Создание коллекции Map для заказов клиентов
const clientOrders = new Map();

// Добавление заказов клиентов
clientOrders.set({ name: "Алексей" }, ['Пицца "Пепперони"', "Тирамису"]);
clientOrders.set({ name: "Мария" }, ['Суши "Калифорния"', 'Пицца "Маргарита"']);
clientOrders.set({ name: "Ирина" }, ["Чизкейк"]);

// Вывод информации о поварах и их специализации
console.log("Повара и их специализация:");
for (let [chef, specialization] of chefsSpecialization) {
  console.log(`${chef} - специализация: ${specialization}`);
}

// Вывод информации о блюдах и их поваре
console.log("\nБлюда и их повар:");
for (let [dish, chef] of dishesAndChefs) {
  console.log(`${dish} - повар: ${chef}`);
}

// Вывод информации о заказах клиентов
console.log("\nЗаказы клиентов:");
for (let [client, order] of clientOrders) {
  console.log(`${client.name} заказал: ${order.join(", ")}`);
}
